{"weightsManifest": [{"weights": [{"shape": [3, 3, 3, 64], "name": "block1_conv1/kernel", "dtype": "float32"}, {"shape": [64], "name": "block1_conv1/bias", "dtype": "float32"}, {"shape": [3, 3, 64, 64], "name": "block1_conv2/kernel", "dtype": "float32"}, {"shape": [64], "name": "block1_conv2/bias", "dtype": "float32"}, {"shape": [3, 3, 64, 128], "name": "block2_conv1/kernel", "dtype": "float32"}, {"shape": [128], "name": "block2_conv1/bias", "dtype": "float32"}, {"shape": [3, 3, 128, 128], "name": "block2_conv2/kernel", "dtype": "float32"}, {"shape": [128], "name": "block2_conv2/bias", "dtype": "float32"}, {"shape": [3, 3, 128, 256], "name": "block3_conv1/kernel", "dtype": "float32"}, {"shape": [256], "name": "block3_conv1/bias", "dtype": "float32"}, {"shape": [3, 3, 256, 256], "name": "block3_conv2/kernel", "dtype": "float32"}, {"shape": [256], "name": "block3_conv2/bias", "dtype": "float32"}, {"shape": [3, 3, 256, 256], "name": "block3_conv3/kernel", "dtype": "float32"}, {"shape": [256], "name": "block3_conv3/bias", "dtype": "float32"}, {"shape": [3, 3, 256, 512], "name": "block4_conv1/kernel", "dtype": "float32"}, {"shape": [512], "name": "block4_conv1/bias", "dtype": "float32"}, {"shape": [3, 3, 512, 512], "name": "block4_conv2/kernel", "dtype": "float32"}, {"shape": [512], "name": "block4_conv2/bias", "dtype": "float32"}, {"shape": [3, 3, 512, 512], "name": "block4_conv3/kernel", "dtype": "float32"}, {"shape": [512], "name": "block4_conv3/bias", "dtype": "float32"}, {"shape": [3, 3, 512, 512], "name": "block5_conv1/kernel", "dtype": "float32"}, {"shape": [512], "name": "block5_conv1/bias", "dtype": "float32"}, {"shape": [3, 3, 512, 512], "name": "block5_conv2/kernel", "dtype": "float32"}, {"shape": [512], "name": "block5_conv2/bias", "dtype": "float32"}, {"shape": [3, 3, 512, 512], "name": "block5_conv3/kernel", "dtype": "float32"}, {"shape": [512], "name": "block5_conv3/bias", "dtype": "float32"}, {"shape": [4608, 256], "name": "dense_1/kernel", "dtype": "float32"}, {"shape": [256], "name": "dense_1/bias", "dtype": "float32"}, {"shape": [256, 2], "name": "dense_2/kernel", "dtype": "float32"}, {"shape": [2], "name": "dense_2/bias", "dtype": "float32"}], "paths": ["group1-shard1of16.bin", "group1-shard2of16.bin", "group1-shard3of16.bin", "group1-shard4of16.bin", "group1-shard5of16.bin", "group1-shard6of16.bin", "group1-shard7of16.bin", "group1-shard8of16.bin", "group1-shard9of16.bin", "group1-shard10of16.bin", "group1-shard11of16.bin", "group1-shard12of16.bin", "group1-shard13of16.bin", "group1-shard14of16.bin", "group1-shard15of16.bin", "group1-shard16of16.bin"]}], "convertedBy": "TensorFlow.js Converter v1.0.1", "generatedBy": "keras v2.2.4", "modelTopology": {"backend": "tensorflow", "training_config": {"metrics": ["accuracy"], "loss": "categorical_crossentropy", "sample_weight_mode": null, "loss_weights": null, "optimizer_config": {"class_name": "SGD", "config": {"momentum": 0.8999999761581421, "decay": 0.0, "lr": 0.0010000000474974513, "nesterov": false}}}, "keras_version": "2.2.4", "model_config": {"class_name": "Model", "config": {"name": "model_1", "input_layers": [["input_1", 0, 0]], "output_layers": [["sequential_1", 1, 0]], "layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "input_1", "config": {"sparse": false, "name": "input_1", "dtype": "float32", "batch_input_shape": [null, 100, 100, 3]}}, {"class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "block1_conv1", "config": {"dilation_rate": [1, 1], "activation": "relu", "bias_constraint": null, "strides": [1, 1], "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "filters": 64, "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "use_bias": true, "name": "block1_conv1", "padding": "same", "bias_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "Conv2D", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]], "name": "block1_conv2", "config": {"dilation_rate": [1, 1], "activation": "relu", "bias_constraint": null, "strides": [1, 1], "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "filters": 64, "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "use_bias": true, "name": "block1_conv2", "padding": "same", "bias_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["block1_conv2", 0, 0, {}]]], "name": "block1_pool", "config": {"pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "name": "block1_pool", "padding": "valid", "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["block1_pool", 0, 0, {}]]], "name": "block2_conv1", "config": {"dilation_rate": [1, 1], "activation": "relu", "bias_constraint": null, "strides": [1, 1], "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "filters": 128, "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "use_bias": true, "name": "block2_conv1", "padding": "same", "bias_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "Conv2D", "inbound_nodes": [[["block2_conv1", 0, 0, {}]]], "name": "block2_conv2", "config": {"dilation_rate": [1, 1], "activation": "relu", "bias_constraint": null, "strides": [1, 1], "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "filters": 128, "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "use_bias": true, "name": "block2_conv2", "padding": "same", "bias_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["block2_conv2", 0, 0, {}]]], "name": "block2_pool", "config": {"pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "name": "block2_pool", "padding": "valid", "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["block2_pool", 0, 0, {}]]], "name": "block3_conv1", "config": {"dilation_rate": [1, 1], "activation": "relu", "bias_constraint": null, "strides": [1, 1], "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "filters": 256, "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "use_bias": true, "name": "block3_conv1", "padding": "same", "bias_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "Conv2D", "inbound_nodes": [[["block3_conv1", 0, 0, {}]]], "name": "block3_conv2", "config": {"dilation_rate": [1, 1], "activation": "relu", "bias_constraint": null, "strides": [1, 1], "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "filters": 256, "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "use_bias": true, "name": "block3_conv2", "padding": "same", "bias_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "Conv2D", "inbound_nodes": [[["block3_conv2", 0, 0, {}]]], "name": "block3_conv3", "config": {"dilation_rate": [1, 1], "activation": "relu", "bias_constraint": null, "strides": [1, 1], "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "filters": 256, "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "use_bias": true, "name": "block3_conv3", "padding": "same", "bias_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["block3_conv3", 0, 0, {}]]], "name": "block3_pool", "config": {"pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "name": "block3_pool", "padding": "valid", "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["block3_pool", 0, 0, {}]]], "name": "block4_conv1", "config": {"dilation_rate": [1, 1], "activation": "relu", "bias_constraint": null, "strides": [1, 1], "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "filters": 512, "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "use_bias": true, "name": "block4_conv1", "padding": "same", "bias_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "Conv2D", "inbound_nodes": [[["block4_conv1", 0, 0, {}]]], "name": "block4_conv2", "config": {"dilation_rate": [1, 1], "activation": "relu", "bias_constraint": null, "strides": [1, 1], "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "filters": 512, "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "use_bias": true, "name": "block4_conv2", "padding": "same", "bias_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "Conv2D", "inbound_nodes": [[["block4_conv2", 0, 0, {}]]], "name": "block4_conv3", "config": {"dilation_rate": [1, 1], "activation": "relu", "bias_constraint": null, "strides": [1, 1], "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "filters": 512, "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "use_bias": true, "name": "block4_conv3", "padding": "same", "bias_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["block4_conv3", 0, 0, {}]]], "name": "block4_pool", "config": {"pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "name": "block4_pool", "padding": "valid", "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["block4_pool", 0, 0, {}]]], "name": "block5_conv1", "config": {"dilation_rate": [1, 1], "activation": "relu", "bias_constraint": null, "strides": [1, 1], "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "filters": 512, "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "use_bias": true, "name": "block5_conv1", "padding": "same", "bias_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "Conv2D", "inbound_nodes": [[["block5_conv1", 0, 0, {}]]], "name": "block5_conv2", "config": {"dilation_rate": [1, 1], "activation": "relu", "bias_constraint": null, "strides": [1, 1], "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "filters": 512, "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "use_bias": true, "name": "block5_conv2", "padding": "same", "bias_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "Conv2D", "inbound_nodes": [[["block5_conv2", 0, 0, {}]]], "name": "block5_conv3", "config": {"dilation_rate": [1, 1], "activation": "relu", "bias_constraint": null, "strides": [1, 1], "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "filters": 512, "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "use_bias": true, "name": "block5_conv3", "padding": "same", "bias_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["block5_conv3", 0, 0, {}]]], "name": "block5_pool", "config": {"pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "name": "block5_pool", "padding": "valid", "trainable": true}}, {"class_name": "Sequential", "inbound_nodes": [[["block5_pool", 0, 0, {}]]], "name": "sequential_1", "config": {"name": "sequential_1", "layers": [{"class_name": "Flatten", "config": {"data_format": "channels_last", "name": "flatten_1", "dtype": "float32", "trainable": true, "batch_input_shape": [null, 3, 3, 512]}}, {"class_name": "Dense", "config": {"activation": "relu", "bias_constraint": null, "units": 256, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "name": "dense_1", "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "noise_shape": null, "rate": 0.5, "trainable": true, "seed": null}}, {"class_name": "Dense", "config": {"activation": "softmax", "bias_constraint": null, "units": 2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "name": "dense_2", "bias_regularizer": null}}]}}]}}}, "format": "layers-model"}